pegasus/test/wetest/wsman/Create/Create_InvalidPropertyName01.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
<s:Header>
  <a:To>http://localhost/wsman</a:To>
  <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/PG_TestPropertyTypes</w:ResourceURI>
 <a:ReplyTo>
  <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
 </a:ReplyTo>
  <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Create</a:Action>
  <a:MessageID>uuid:00000000-0000-0000-0003-000000000005</a:MessageID>
  <w:Locale xml:lang="en-US" s:mustUnderstand="false" />
  <w:SelectorSet>
  <w:Selector Name="__cimnamespace">test/static</w:Selector>
  </w:SelectorSet>
</s:Header>
<s:Body>
    <p:PG_TestPropertyTypes xmlns:p="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/PG_TestPropertyTypes">
    <p:InstanceId>1</p:InstanceId>
    <p:PropertyString>created_instance1</p:PropertyString>
    <p:PropertyUint8>180</p:PropertyUint8>
    <p:PropertyUint16>1600</p:PropertyUint16>
    <p:PropertyUint32>13200</p:PropertyUint32>
    <!-- Specifies an invalid property -->
    <p:NonexistentPropertyUint64>16400</p:NonexistentPropertyUint64>
    <p:PropertySint8>-110</p:PropertySint8>
    <p:PropertySint16>-1600</p:PropertySint16>
    <p:PropertySint32>-13200</p:PropertySint32>
    <p:PropertySint64>-16400</p:PropertySint64>
    <p:PropertyBoolean>true</p:PropertyBoolean>
    <p:PropertyReal32>1.3245</p:PropertyReal32>
    <p:PropertyReal64>1.6445</p:PropertyReal64>
    <p:PropertyDateTime>20010515104354.000000:000</p:PropertyDateTime>
    </p:PG_TestPropertyTypes>
</s:Body>
</s:Envelope>
